tap "aws/tap"
tap "eugenmayer/dockersync"
tap "homebrew/bundle"
tap "homebrew/services"
tap "reainternal/stable", "git@git.realestate.com.au:cowbell/homebrew-stuff"
tap "remotemobprogramming/brew"
brew "automake"
brew "openssl@3"
brew "cryptography"
brew "libyaml"
brew "readline"
brew "python@3.13"
brew "aws-sam-cli"
brew "bison"
brew "chruby"
brew "direnv"
brew "docker-compose"
brew "docker-credential-helper-ecr"
brew "fish"
brew "fnm"
brew "fzf"
brew "gcc"
brew "gdbm"
brew "gh"
brew "git"
brew "git-delta"
brew "hadolint"
brew "jq"
brew "libffi"
brew "libpq"
brew "libsass"
brew "make"
brew "neovim"
brew "nvm"
brew "openssl@1.1"
brew "pipx"
brew "postgresql@12"
brew "postgresql@14"
brew "python@3.10"
brew "python@3.12"
brew "tcl-tk"
brew "python@3.8"
brew "python@3.9"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "ruby-install"
brew "sassc"
brew "shellcheck"
brew "tree"
brew "unison"
brew "wakeonlan"
brew "zoxide"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "eugenmayer/dockersync/unox"
brew "remotemobprogramming/brew/mob"
cask "bluesnooze"
cask "fig"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "maccy"
cask "miniconda"
cask "powershell"
cask "warp"
vscode "alexkrechik.cucumberautocomplete"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "amodio.tsl-problem-matcher"
vscode "andys8.jest-snippets"
vscode "asvetliakov.vscode-neovim"
vscode "bierner.markdown-mermaid"
vscode "ckolkman.vscode-postgres"
vscode "cschlosser.doxdocgen"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "github.github-vscode-theme"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jeff-hykin.better-cpp-syntax"
vscode "johnpapa.vscode-peacock"
vscode "jzmstrjp.color-the-tag-name"
vscode "kaiwood.endwise"
vscode "karunamurti.rspec-snippets"
vscode "madhavd1.javadoc-tools"
vscode "mhutchie.git-graph"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.powershell"
vscode "msjsdiag.vscode-react-native"
vscode "pradiphudekar.cf-templates"
vscode "rbuckton.tsserver-live-reload"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "streetsidesoftware.code-spell-checker"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "unthrottled.doki-theme"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vspacecode.whichkey"
vscode "yoavbls.pretty-ts-errors"
vscode "zhuangtongfa.material-theme"
